{
  "about": [
    { 
      "content": "I am an aspiring software engineer studying Computer Science at Dartmouth. I began my coding career at Los Gatos High School, and since then have taken courses in Software Design and Implementation, Algorithms, Applied Cryptography, Full-Stack Web Development, Machine Learning and Statistical Analysis, among other areas.",
      "key": 0
    },
    {
      "content": "At Dartmouth I have experience working as a teacher’s assistant and as a developer for HackDartmouth, the club which organizes the annual Dartmouth hackathon. I also had some amazing internships at Minerva Networks, Grove Collaborative, and NVIDIA.",
      "key": 1
    },
    {
      "content": "Through my academics and professional experience, I’ve learned Java, Python, C, PHP, and Javascript. I’m familiar with frameworks such as React, React-Native, Node, and Flask. I’ve also used tools such as Airflow, Selenium, MongoDB, Docker and Heroku for deployment, and Git for version control.",
      "key": 2
    },
    {
      "content": "Aside from CS, I spend most of my time playing ultimate frisbee with Dartmouth’s PainTrain and organizing Dartmouth’s annual hackathon with HackDartmouth.",
      "key": 3
    }
  ],
  "experience": [
    {
      "content": "I currently work as a software engineer for the platform team.",
      "date": "Jul 2020 - Present",
      "key": "grove2020Pres",
      "logo": "grove",
      "style": "grove",
      "title": "Grove Collaborative"
    },
    {
      "content": "At NVIDIA, I joined the software security tools team. I created a web service which synthesized data from multiple sources into a bulletin documenting security vulnerabilities. I utilized Angular, Flask, SQLAlchemy, and Pandas to manipulate and display the data.",
      "date": "Jun - Aug 2019",
      "key": "nvidia",
      "logo": "nvidia",
      "style": "nvidia",
      "title": "NVIDIA"
    },
    {
      "content": "I built API endpoints with Django's REST framework to automate a labor-intensive cancellation process, and I helped the customer support team by developing Zendesk filtering scripts.",
      "date": "Nov 2018 - Mar 2019",
      "key": "grove20182019",
      "logo": "grove",
      "style": "grove",
      "title": "Grove Collaborative"
    },
    {
      "content": "I worked as a Teacher's Assistant for CS50 - Software Design and Implementation. I orchestrated weekly recitation sessions, supervised a final project team, and graded all labs.",
      "date": "Jun - Aug 2018",
      "key": "dartmouth",
      "logo": "dartmouth",
      "style": "dartmouth",
      "title": "Teacher's Assistant"
    },
    {
      "content": "I designed and developed a quality assurance tool to verify the synchronization between a 3rd party encryption server and a company server. The tool used HTML and JavaScript for the user interface, while PHP handled the server queries.",
      "date": "Jun - Aug 2017",
      "key": "minerva2017",
      "logo": "minerva",
      "style": "minerva",
      "title": "Minerva Networks"
    },
    {
      "content": "I worked as a QA software engineer where I devised automated soak test scripts which simulated user input. I self-taught myself the PERL programming language and reported bugs I found in Jira.",
      "date": "Jun - Aug 2015",
      "key": "minerva2015",
      "logo": "minerva",
      "style": "minerva",
      "title": "Minerva Networks"
    },
    {
      "content": "I wrote automated test scripts in Java using Selenium and StormTest. The scripts tested CSS styles or took a snapshot and compared it to an expected image.",
      "date": "Jun - Aug 2014",
      "key": "minerva2014",
      "logo": "minerva",
      "style": "minerva",
      "title": "Minerva Networks"
    }
  ],
  "portfolio": [
    {
      "content": "For the final project in my databases class, we built [Chef's Kiss](http://chefskiss.surge.sh/), a place to share and find recipes. It comes fully equipped with account authentication, search, favorites, and a small database of recipes. It's deployed on Heroku using a React frontend and an Express/MySQL backend. Check out the code [here](https://github.com/stephenmcrowe/askew-elk)!",
      "key": "chefskiss",
      "logo": "chefskiss"
    },
    {
      "content": "For my culminating experience at Dartmouth, we built a phone app for managing foodstuffs. The app has three components, a React Native frontend, an Express and MongoDB backend, and a flask microservice for managing voice. Check out the [code](https://github.com/dartmouth-cs98/19f-pantri) and an [article](https://medium.com/dartmouth-cs98/pantri-a-modern-approach-to-your-kitchen-fe14bd64570) about it!",
      "key": "pantri",
      "logo": "pantri"
    },
    {
      "content": "For the final project in web development, we created a Quiplash-inspired game without a paywall by utilizing websockets to keep open connections throughout the game. Check out the [game](http://gut-busters.surge.sh/), as well as the [frontend](https://github.com/stephenmcrowe/project-gut-busters) and the [backend](https://github.com/dartmouth-cs52-19S/project-api-gut-busters) code.",
      "key": "gutbusters",
      "logo": "gut_busters"
    },
    {
      "content": "I developed this **website** with React to show off my portfolio and practice my web development skills. All the styling was done with pure css. Curious about the [code](https://github.com/stephenmcrowe/crowestephen.me)?",
      "key": "website",
      "logo": "monitor_mac"
    },
    {
      "content": "As a developer and director of HackDartmouth, I managed 5 teams of roughly 14 people to organize Dartmouth's annual hackathon. I also coordinated the creation of the new HackDartmouth [site](https://hackdartmouth.io/).",
      "key": "hackdartmouth",
      "logo": "hackdartmouth_logo"
    },
    {
      "content": "**Tiny-Search Engine:** A simple search engine that takes in a search query from the user, crawls the web, indexes the pages found, and outputs a ranked list of search results. View the [code](https://github.com/stephenmcrowe/tse) on Github.",
      "key": "tse",
      "logo": "search"
    },
    {
      "content": "As part of my computational linguistics class, we hypothesized that word2vec could be used to easily test biases between news sources. Check out our [findings](https://github.com/stephenmcrowe/cs72-final)!",
      "key": "compling",
      "logo": "handout"
    },
    {
      "content": "We built an **audio visualizer** with a Digilent FPGA, a mic, a VGA monitor, and VHDL. Check out the [demonstration](https://www.youtube.com/watch?v=gN6DgaZrZ-A&feature=youtu.be) or the [project writeup](https://drive.google.com/drive/folders/1Q7ZV0cw9Hs6LIn7KSw2Y9-kqDNEys0gn?usp=sharing).",
      "key": "digitalelectronics",
      "logo": "cpu"
    }
  ],
  "footer": [
    {
      "link": "https://github.com/stephenmcrowe",
      "logo": "github"
    },
    {
      "link": "https://www.linkedin.com/in/stephen-crowe-20",
      "logo": "linkedin"
    },
    {
      "link": "https://www.facebook.com/stephen.crowe.750",
      "logo": "facebook"
    }
  ]
}